IdrisCodes/K64F-Logic-Analyzer/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTD0 (number 93), J2[6]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LOGIC_CHANNEL0_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LOGIC_CHANNEL0_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LOGIC_CHANNEL0_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_LOGIC_CHANNEL0_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_LOGIC_CHANNEL0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD1 (number 94), J2[12]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LOGIC_CHANNEL1_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LOGIC_CHANNEL1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LOGIC_CHANNEL1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_LOGIC_CHANNEL1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_LOGIC_CHANNEL1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD2 (number 95), J2[8]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LOGIC_CHANNEL2_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LOGIC_CHANNEL2_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LOGIC_CHANNEL2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_LOGIC_CHANNEL2_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LOGIC_CHANNEL2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD3 (number 96), J2[10]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LOGIC_CHANNEL3_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LOGIC_CHANNEL3_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LOGIC_CHANNEL3_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_LOGIC_CHANNEL3_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LOGIC_CHANNEL3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC10 (number 82), J4[12]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_TEST_PIN0_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_TEST_PIN0_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_TEST_PIN0_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_TEST_PIN0_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_TEST_PIN0_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORTC11 (number 83), J4[10]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_TEST_PIN1_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_TEST_PIN1_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_TEST_PIN1_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_TEST_PIN1_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_TEST_PIN1_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTC6 (number 78), U8[11]/SW2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW2_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW2_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW2_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_SW2_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTA4 (number 38), SW3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW3_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW3_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW3_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW3_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_SW3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtonsPins(void);

/*! @name PORTB21 (number 67), D12[3]/LEDRGB_BLUE
  @{ */

